In [113]:
""" We are using the Social network ad dataset. The dataset contains the details of users in a social networking site 
to find whether a user buys a product by clicking the ad on the site based on their salary, age, and gender. """

In [114]:
import pandas as pd
import numpy as np

In [115]:
#Importing of dataset
df = pd.read_csv("Purchased.csv")
len(df)

400

In [116]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [117]:
inputs = df.drop('Purchased',axis='columns')
target = df.Purchased

In [118]:
dummies = pd.get_dummies(inputs.Gender)
dummies.head(10)

   Female  Male
0       0     1
1       0     1
2       1     0
3       1     0
4       0     1
5       0     1
6       1     0
7       1     0
8       0     1
9       1     0

In [119]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(10)

    User ID  Gender  Age  EstimatedSalary  Female  Male
0  15624510    Male   19            19000       0     1
1  15810944    Male   35            20000       0     1
2  15668575  Female   26            43000       1     0
3  15603246  Female   27            57000       1     0
4  15804002    Male   19            76000       0     1
5  15728773    Male   27            58000       0     1
6  15598044  Female   27            84000       1     0
7  15694829  Female   32           150000       1     0
8  15600575    Male   25            33000       0     1
9  15727311  Female   35            65000       1     0

In [120]:
#I am dropping male column as well because of dummy variable trap theory. One column is enough to represent male and female category.
inputs.drop(['Gender','Male'],axis='columns',inplace=True)
inputs.head(10)

    User ID  Age  EstimatedSalary  Female
0  15624510   19            19000       0
1  15810944   35            20000       0
2  15668575   26            43000       1
3  15603246   27            57000       1
4  15804002   19            76000       0
5  15728773   27            58000       0
6  15598044   27            84000       1
7  15694829   32           150000       1
8  15600575   25            33000       0
9  15727311   35            65000       1

In [121]:
#Checking for any missing values ( values that are not available or values such as none ) in the dataset
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [122]:
#Train test Split
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)
len(X_test)

80

In [123]:
len(X_train)

320

In [124]:
#Training the Naive Bayes model on the training set
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [125]:
model.fit(X_train,y_train)

GaussianNB()

In [126]:
y_pred  =  model.predict(X_test)
y_pred

array([1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1,
       0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0,
       0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0], dtype=int64)

In [127]:
y_test

307    1
259    1
323    1
226    1
160    1
      ..
37     0
116    0
297    1
92     0
229    1
Name: Purchased, Length: 80, dtype: int64

In [128]:
from sklearn.metrics import accuracy_score
y_testarray=np.array(y_test)
y_testarray.reshape((-1,1))
y_pred.reshape((-1,1))
#Finding the accuracy of the dataset
ac=accuracy_score(y_test,y_pred)
ac

0.8125

In [129]:
X_test[0:10]

      User ID  Age  EstimatedSalary  Female
307  15733973   47           113000       1
259  15815236   45           131000       1
323  15619465   48            30000       1
226  15795224   36           126000       1
160  15744279   32           100000       0
38   15671766   26            72000       1
175  15614420   23            28000       1
23   15599081   45            22000       1
134  15800061   28            55000       1
274  15692819   57            26000       1

In [130]:
y_test[0:10]

307    1
259    1
323    1
226    1
160    1
38     0
175    0
23     1
134    0
274    1
Name: Purchased, dtype: int64